export const FAQ_Questions = [
  {
    question: 'تبلیغات چه کمکی به کسب‌و‌کار من می‌کند؟',
    answer: `تبلیغات در بهترینو از دو راه باعث افزایش بازدید کسب‌وکار شما می‌شود:
۱. کسب‌وکار شما در جایگاهی بالاتر از بقیه‌ی کسب‌وکارها نمایش داده می‌شود.
۲. با استفاده از خدمات تبلیغات بهترینو می‌توانید کسب‌وکار خود را در صفحات بیشتری به نمایش بگذارید. (به‌طور مثال اگر شما فروشگاه پوشاک در میدان ولیعصر داشته باشید، می‌توانید با تنظیم شعاع تبلیغات خود در محدوده‌ی میدان ونک یا میدان پاستور هم دیده شوید.)`
  },
  {
    question:
      'اگر حداکثر هزینه‌ی کلیک را معادل ۱۰،۰۰۰ تومان بگذارم، برای هر کلیک ۱۰،۰۰۰ تومان از حسابم کم می‌شود؟',
    answer: `خیر. میزان مبلغی که به عنوان هزینه‌ی کلیک از حساب شما کم می‌شود عدد ثابتی نیست و رابطه‌ی مستقیمی با فاصله‌ی کسب‌وکار شما از محله‌ی موردنظر دارد. به‌این‌صورت که هرچه به محله‌ی مورد جست‌وجوی مشتری نزدیک‌تر باشید، هزینه‌ی کم‌تر و هرچه دورتر باشید هزینه‌ی بیشتری از حساب شما کم می‌شود. به‌عبارت دیگر، در نزدیک‌ترین فاصله کمترین هزینه و در دورترین فاصله حداکثر هزینه کم خواهد شد.`
  },
  {
    question: 'یک فروشگاه پوشاک در میدان ولیعصر دارم، آیا می‌توانم در سایر محله‌ها هم دیده شوم؟',
    answer: `بله. با افزایش هزینه‌ی هر کلیک می‌توانید محدوده‌ی نمایش تبلیغات کلیکی خود را افزایش دهید. (این محدوده به‌صورت پیش‌فرض معادل ۳ کیلومتر است).
* در نظر داشته باشید هرچه در محدوده‌ی دورتری نمایش داده شوید هزینه‌ی هر کلیک برای شما بیش‌تر خواهد بود. در‌نتیجه هنگام تعیین محدوده‌ی نمایش به این مسئله فکر کنید که دیده شدن در محله‌های دورتر ارزش پرداخت هزینه‌ی بیش‌تر را دارد؟`
  },
  {
    question: 'چرا با وجود افزایش محدوده‌ی نمایش، تبلیغات کلیکی من در صفحه جایگاه بالایی ندارد؟',
    answer: `در زمان رقابت بین چند کسب‌وکار، چند عامل بر جایگاه شما اثرگذار است. فاصله، هزینه‌ی کلیک و داشتن عضویت.
 - هرچه هزینه‌ی کلیک شما بیش‌تر باشد شانس بیش‌تری برای بالاتر دیده شدن دارید.
- هرچه کسب‌وکار شما به محله‌ی مورد جست‌وجوی مشتری نزدیک‌تر باشد، شانس بیش‌تری برای بالاتر دیده شدن دارید.
-در صورتی که به لحاظ فاصله و هزینه‌ی کلیک، دارای شرایط یکسانی با رقیب‌های‌تان باشید، داشتن عضویت، شانس شما را برای بالاتر دیده شدن بیش‌تر می‌کند.`
  },
  {
    question: 'در صورت اتمام شارژ تبلیغات حسابم، کسب‌و‌کارم در سایت نمایش داده نمی‌شود؟',
    answer: `در صورت تمام‌شدن شارژ تبلیغات‌تان، "تبلیغات کلیکی" کسب‌وکار شما دیگر نمایش داده نمی‌شود. اما پروفایل کسب‌وکار شما همچنان در جست‌وجوی کاربران دیده می‌شود. (همانطور که می‌دانید تعداد صفحاتی که در آن دیده می‌شوید به نوع عضویت و تعداد کلیدواژه‌های شما وابسته است).`
  }
];
