import { Subscription } from '@typings/Subscription';

export const SubscriptionCompareTableData = [
  {
    feat: 'کلیدواژه‌ها',
    secondary: 'با تعیین کلیدواژه برای کسب‌و‌کارتان به دیده‌ شدن آن در صفحه‌های متفاوت کمک کنید.',
    normal: '3',
    pro: '10',
    VIP: 'نامحدود'
  },
  {
    feat: 'نمایش تصویر و ویدئو',
    secondary: 'با ثبت تصویر و ویدئوهای کسب‌و‌کارتان به کاربران برای گرفتن تصمیم بهتر کمک کنید.',
    normal: '10',
    pro: '20',
    VIP: 'نامحدود'
  },
  {
    feat: 'نشان اعتماد کنار اسم',
    secondary:
      'داشتن بج آبی کنار اسم کسب‌و‌کارتان باعث اعتماد بیشتر کاربران به کسب‌و‌کارتان می‌شود.',
    normal: false,
    pro: true,
    VIP: true
  },
  {
    feat: 'نمایش آدرس سایت',
    secondary: 'با ثبت آدرس سایت کسب‌و‌کارتان، راه‌های ارتباطی مشتری‌های‌تان را بیشتر کنید.',
    normal: false,
    pro: true,
    VIP: true
  },
  {
    feat: 'شارژ بیشتر برای تبلیغات',
    secondary: 'با توجه به عضویت‌تان، درصد بیشتری شارژ برای تبلیغات کلیکی دریافت کنید.',
    normal: false,
    pro: '15%',
    VIP: '30%'
  },
  {
    feat: 'فعال‌سازی چت واتس‌اپ',
    secondary: 'برای ارتباط سریع و راحت مشتری‌ها با کسب‌و‌کارتان شماره‌ی واتس‌اپ را وارد کنید.',
    normal: false,
    pro: true,
    VIP: true
  },
  {
    feat: 'عدم نمایش رقیب‌ها در صفحه کسب‌و‌کارتان',
    secondary:
      'از نمایش رقیب‌های‌تان در صفحه‌ی کسب‌و‌کارتان جلوگیری کنیدو شانس فروش خود را بیشتر کنید.',
    normal: false,
    pro: false,
    VIP: true
  },
  {
    feat: 'سفارش آنلاین',
    secondary: 'امکان سفارش کالاها و خدمت‌های‌تان را در صفحه‌ی کسب‌وکارتان مهیا کنید.',
    normal: false,
    pro: false,
    VIP: true
  },
  {
    feat: 'نمایش لیست خدمات و محصولات',
    secondary: 'لیست‌ خدمت‌ها و کالاهای‌تان را برای تصمیم راحت‌تر کاربر نمایش دهید.',
    normal: false,
    pro: false,
    VIP: true
  },
  {
    feat: 'پشتیبانی اختصاصی',
    secondary: 'پشتیبان اختصاصی خود را داشته باشید.',
    normal: false,
    pro: false,
    VIP: true
  }
];

export const NewSubscriptionFeatureTexts = ({
  can_have_fifty_percent_discount: moreDiscount
}: Subscription) => [
  [
    {
      title: 'عضویت ساده',
      description: 'کسب‌و‌کار شما به‌صورت پیش‌فرض شامل عضویت رایگان می‌شود.',
      disabledText: 'رایگان',
      features: ['۳ کلیدواژه', 'نمایش تصویر و ویدئو']
    },
    {
      title: 'عضویت پیشرفته',
      description:
        'اگر کسب‌و‌کار شما متوسط است و رقیب زیادی ندارید، عضویت پیشرفته برای شما گزینه‌ی مناسبی است.',
      totalPrice: 1_200_000,
      giftPrice: 100_000,
      discountedPrice: moreDiscount ? 600_000 : 1_200_000,
      features: ['نشان اعتماد کنار اسم کسب‌و‌کارتان', '۱۰ کلیدواژه', '۱۵٪ شارژ تبلیغات بیشتر']
    },
    {
      title: 'عضویت VIP',
      description:
        'اگر کسب‌و‌کار بزرگی دارید و رقیب‌های زیادی دارید، عضویت VIP به شما کمک می‌کند بیشتر دیده شوید.',
      totalPrice: 2_400_000,
      discountedPrice: moreDiscount ? 1_200_000 : 2_400_000,
      giftPrice: 250_000,
      features: [
        'نشان اعتماد کنار اسم کسب‌و‌کارتان',
        'تعداد کلیدواژه‌ی نامحدود',
        '۳۰٪ شارژ تبلیغات بیشتر'
      ]
    }
  ],
  [
    {
      title: 'عضویت ساده',
      description: 'کسب‌و‌کار شما به‌صورت پیش‌فرض شامل عضویت رایگان می‌شود.',
      disabledText: 'رایگان',
      features: ['۳ کلیدواژه', 'نمایش تصویر و ویدئو']
    },
    {
      title: 'عضویت پیشرفته',
      description:
        'اگر کسب‌و‌کار شما متوسط است و رقیب زیادی ندارید، عضویت پیشرفته برای شما گزینه‌ی مناسبی است.',
      totalPrice: 2_000_000,
      giftPrice: 220_000,
      discountedPrice: moreDiscount ? 1_000_000 : 1_600_000,
      features: ['نشان اعتماد کنار اسم کسب‌و‌کارتان', '۱۰ کلیدواژه', '۱۵٪ شارژ تبلیغات بیشتر']
    },
    {
      title: 'عضویت VIP',
      description:
        'اگر کسب‌و‌کار بزرگی دارید و رقیب‌های زیادی دارید، عضویت VIP به شما کمک می‌کند بیشتر دیده شوید.',
      totalPrice: 4_240_000,
      giftPrice: 520_000,
      discountedPrice: moreDiscount ? 2_120_000 : 3_392_000,
      features: [
        'نشان اعتماد کنار اسم کسب‌و‌کارتان',
        'تعداد کلیدواژه‌ی نامحدود',
        '۳۰٪ شارژ تبلیغات بیشتر'
      ]
    }
  ],
  [
    {
      title: 'عضویت ساده',
      description: 'کسب‌و‌کار شما به‌صورت پیش‌فرض شامل عضویت رایگان می‌شود.',
      disabledText: 'رایگان',
      features: ['۳ کلیدواژه', 'نمایش تصویر و ویدئو']
    },
    {
      title: 'عضویت پیشرفته',
      description:
        'اگر کسب‌و‌کار شما متوسط است و رقیب زیادی ندارید، عضویت پیشرفته برای شما گزینه‌ی مناسبی است.',
      totalPrice: 3_500_000,
      giftPrice: 500_000,
      discountedPrice: moreDiscount ? 1_700_000 : 2_100_000,
      features: ['نشان اعتماد کنار اسم کسب‌و‌کارتان', '۱۰ کلیدواژه', '۱۵٪ شارژ تبلیغات بیشتر']
    },
    {
      title: 'عضویت VIP',
      description:
        'اگر کسب‌و‌کار بزرگی دارید و رقیب‌های زیادی دارید، عضویت VIP به شما کمک می‌کند بیشتر دیده شوید.',
      totalPrice: 7_800_000,
      giftPrice: 1_100_000,
      discountedPrice: moreDiscount ? 3_900_000 : 4_680_000,
      features: [
        'نشان اعتماد کنار اسم کسب‌و‌کارتان',
        'تعداد کلیدواژه‌ی نامحدود',
        '۳۰٪ شارژ تبلیغات بیشتر'
      ]
    }
  ]
];
